Autodesk.Revit.DB.InternalDefinition.BuiltInParameter
Identifies if the parameter is a BuiltIn parameter.
Remarks:  If the parameter is not a BuiltIn parameter (e.g. it is a shared parameter or family parameter),
BuiltInParameter.INVALID will be returned.

Autodesk.Revit.DB.InternalDefinition.ParameterGroup
Returns the group ID of the parameter definition.

Autodesk.Revit.DB.InternalDefinition
This object represents a parameter definition in Autodesk Revit.